package src.alishevTasks.day1;

/**
 * Вывести на экран слово "JAVA" в столбик 10 раз, используя любой цикл
 */
public class Task3 {
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println("JAVA");
        }
    }
}
